<template>
  <div class="Detailspage">
    <!-- 首页详情页 -->
    <div class="blue">
      <div style="font-size:0.4rem;padding-top:0.2rem;">
        <span style="color:white;padding-left:0.4rem;" @click="$router.go(-1)"><</span>
        <span style="color:white;padding-left:2.2rem;">讲师详情</span>
      </div>
    </div>
    <!-- 关注 -->
   
    <div class="follow" >
      <div class="follow1 " v-show='falg'>
        <ul>
          <li>
            <img src="@/assets/img/jun/n.gif" alt />
          </li>
          <li style="font-size:0.3rem;padding-top:0.2rem;">暂无数据</li>
          <li style="font-size:0.3rem;padding-top:0.2rem;">
            <button>关注</button>
          </li>
        </ul>
      </div>
    </div>
  
   
    <div class="follow" style="margin-top:-1.2rem;" v-show="falg=='false'">
      <div class="follow1" >
        <ul>
          <li>
            <img :src="arr.teacher_avatar" alt />
          </li>
          <li style="font-size:0.3rem;padding-top:0.2rem;">{{arr.teacher_name}}</li>
          <li style="font-size:0.3rem;padding-top:0.2rem;">
            <button @click='guanzhu'>{{this.gz==1?'关注':'已关注'}}</button>
          </li>
        </ul>
      </div>
    </div>
    
    <!-- 关注 -->
     
    <div class="follow2">
        <van-sticky @scroll='scroll1'>
      <van-tabs v-model="active">
        <van-tab name='0' title="讲师介绍">
          <span style="font-size:0.24rem;">讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍讲师介绍</span>
        </van-tab>
        <van-tab name='1' title="主讲课程">
          <span style="font-size:0.24rem;">主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程主讲课程</span>
        </van-tab>
        <van-tab name='2' title="学院评价">
          <span style="font-size:0.24rem;">学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价学院评价</span>
        </van-tab>
      </van-tabs>
      </van-sticky>
    </div>
     
  </div>
</template>

<script>
import { indexdettails,indexgz } from "../../utils/api/index.js";
export default {
  name: "",
  props: {},
  data() {
    return {
      id: "",
      active:'0',
      arr:[],
      falg:'',
      follow:true,
      gz:1,
    };
  },
  mounted() {
    this.id = this.$route.query.id.teacher_id;
    console.log(this.$route.query.id.teacher_id)
    this.arr=this.$route.query.id
    // if(this.arr.teacher_id>-1){
      //  this.arr.gz=true
    // }
    console.log(this.arr);
    this.falg='false'
    if(this.$route.query.id=='[object MouseEvent]'){
      console.log('666')
    this.falg='true'
      this.arr=[{teacher_id: 3, teacher_name: "杨德胜", teacher_avatar: "https://msmk2019.oss-cn-shanghai.aliyuncs.com/uploads/image/2019X3gWvILU7J1571983543.png", introduction: "　杨老师,特级教师.多次被中国数学会评为全国高中数学竞联赛优秀教练员。长期从事名校理科班的数学教学和…别是近年来大学试行自主招生，有很多同学通过上他的竞赛辅导课进入清华大学、北京大学、上海交通大学等。"}]
    }
     indexdettails(this.id).then(res => {
       console.log(res);
});
  },
  components: {},
  computed: {},
  methods: {
    guanzhu(){
      this.gz=2
      console.log(this.id)
      indexgz(this.id).then(res=>{

        console.log(res)
        this.gz=res.data.flag
        if(res.code==200){
          this.$toast('关注成功');
        }
        if(this.gz==1){
            this.$toast('取消关注');
        }
      })
      // let guanzhu=[]
      // console.log(this.arr)
      // console.log(this.arr.gz)
      // console.log(this.$store.state.teach)
      // this.arr.gz=!this.arr.gz;
      // let obj = {
      //   flag : this.arr.gz,
      //   teacher_name :this.arr.teacher_name
      // }
      // console.log(obj)
      // if(this.arr.gz){
      //   this.gz='关注'
      // }else{
      //   this.gz='已关注'
      //   console.log(this.arr)
      //   this.$store.commit('set_teacher',this.arr)
      // }


    },
    scroll1(data){
      // console.log(data)
      if(data.scrollTop>500){
        this.active='0'
       
      }
      if(data.scrollTop>1000){
        this.active='1'
       
      }
      if(data.scrollTop>1500){
        this.active='2'
  
      }
    }
  },
 
};
</script>

<style scoped>
</style>
